ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM363.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_WDT</name>
			<description>Watchdog Timer</description>
			<groupName>WDT</groupName>
			<baseAddress>0x40002580</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1C</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>T3LD</name>
					<description>Load value.</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00001000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T3VAL</name>
					<description>Current count value, read only.</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00001000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T3CON</name>
					<description>Control Register</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x000000E9</resetValue>
					<fields>
						<field>
							<name>MOD</name>
							<description>Mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>FREERUN</name>
                     <description>FREERUN</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PERIODIC</name>
                     <description>PERIODIC</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE</name>
							<description>Prescaler</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
                     <description>DIV1</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
                     <description>DIV16</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
                     <description>DIV256</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4096</name>
                     <description>DIV4096</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ</name>
							<description>Timer Interrupt ,</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD</name>
							<description>Power down clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T3CLRI</name>
					<description>Clear interrupt, write only.</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
             <access>write-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Clear Watchdog</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>52428</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T3STA</name>
					<description>Status register, read only.</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00000020</resetValue>
					<fields>
						<field>
							<name>LOCK</name>
							<description>Lock status bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON</name>
							<description>T3CON write sync in progress</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LD</name>
							<description>T3LD write sync in progress</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLRI</name>
							<description>T3CLRI write sync in progress</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IRQ</name>
							<description>Interrupt Pending</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
