ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM363.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_WUT</name>
			<description>WakeUp Timer</description>
			<groupName>WUT</groupName>
			<baseAddress>0x40002500</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x44</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>T2VAL0</name>
					<description>Current count value LSB</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T2VAL1</name>
					<description>Current count value MSB</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T2CON</name>
					<description>Control Register</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000040</resetValue>
					<fields>
						<field>
							<name>STOPINC</name>
							<description>Stop wake up field A being updated</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLK</name>
							<description>Clock</description>
							<bitOffset>9</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>PCLK</name>
                     <description>PCLK</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFXTAL</name>
                     <description>LFXTAL</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LFOSC</name>
                     <description>LFOSC</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTCLK</name>
                     <description>EXTCLK</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUEN</name>
							<description>WUEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MOD</name>
							<description>Mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>PERIODIC</name>
                     <description>PERIODIC</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FREERUN</name>
                     <description>FREERUN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FREEZE</name>
							<description>Freeze</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRE</name>
							<description>Prescaler</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
                     <description>DIV1</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV16</name>
                     <description>DIV16</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV256</name>
                     <description>DIV256</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV32768</name>
                     <description>DIV32768</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T2INC</name>
					<description>12-bit register. Wake up field A</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x000000C8</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>12 bit value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFB0</name>
					<description>Wake up field B  LSB</description>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00001FFF</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFB1</name>
					<description>Wake up field B  MSB</description>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFC0</name>
					<description>Wake up field C  LSB</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00002FFF</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFC1</name>
					<description>Wake up field C  MSB</description>
					<addressOffset>0x0000001C</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFD0</name>
					<description>Wake up field D  LSB</description>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00003FFF</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T2WUFD1</name>
					<description>Wake up field D  MSB</description>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Current Value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>T2IEN</name>
					<description>Interrupt enable</description>
					<addressOffset>0x00000028</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ROLL</name>
							<description>Enable interrupt on Rollover</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFD</name>
							<description>Enable interrupt on WUFD</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFC</name>
							<description>Enable interrupt on WUFC</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFB</name>
							<description>Enable interrupt on WUFB</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFA</name>
							<description>Enable interrupt on WUFA</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T2STA</name>
					<description>Status</description>
					<addressOffset>0x0000002C</addressOffset>
					<size>0x00000010</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CON</name>
							<description>Sync</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FREEZE</name>
							<description>Timer Value Freeze</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ROLL</name>
							<description>Rollover Interrupt</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFD</name>
							<description>WUFD Interrupt</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFC</name>
							<description>WUFC Interrupt</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFB</name>
							<description>WUFB Interrupt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUFA</name>
							<description>WUFA Interrupt</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
                     <description>SET</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
