ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM363.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>ADI_GPIO1</name>
			<description>General Purpose Input Output</description>
			<groupName>GPIO</groupName>
			<baseAddress>0x40006030</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x28</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>GP1CON</name>
					<description>GPIO Port 1 configuration</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CON7</name>
							<description>Configuration bits for P1.7</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIOIRQ7</name>
                     <description>GPIOIRQ7</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM5</name>
                     <description>PWM5</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI0CS</name>
                     <description>SPI0CS</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON6</name>
							<description>Configuration bits for P1.6</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIOIRQ6</name>
                     <description>GPIOIRQ6</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM4</name>
                     <description>PWM4</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI0MOSI</name>
                     <description>SPI0MOSI</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON5</name>
							<description>Configuration bits for P1.5</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIOIRQ5</name>
                     <description>GPIOIRQ5</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM3</name>
                     <description>PWM3</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI0SCLK</name>
                     <description>SPI0SCLK</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON4</name>
							<description>Configuration bits for P1.4</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
                     <description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM2</name>
                     <description>PWM2</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SPI0MISO</name>
                     <description>SPI0MISO</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON3</name>
							<description>Configuration bits for P1.3</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
                     <description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM1</name>
                     <description>PWM1</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON2</name>
							<description>Configuration bits for P1.2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIO</name>
                     <description>GPIO</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM0</name>
                     <description>PWM0</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON1</name>
							<description>Configuration bits for P1.1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIOIRQ4</name>
                     <description>GPIOIRQ4</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWMTRIP</name>
                     <description>PWMTRIP</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CON0</name>
							<description>Configuration bits for P1.0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPIOIRQ3</name>
                     <description>GPIOIRQ3</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWMSYNC</name>
                     <description>PWMSYNC</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTCLKIN</name>
                     <description>EXTCLKIN</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP1OEN</name>
					<description>GPIO Port 1 output enable</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000008</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OEN7</name>
							<description>Direction for port pin</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>IN</name>
                     <description>IN</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUT</name>
                     <description>OUT</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN6</name>
							<description>Direction for port pin</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>IN</name>
                     <description>IN</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUT</name>
                     <description>OUT</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN5</name>
							<description>Direction for port pin</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>IN</name>
                     <description>IN</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUT</name>
                     <description>OUT</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN4</name>
							<description>Direction for port pin</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>IN</name>
                     <description>IN</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUT</name>
                     <description>OUT</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN3</name>
							<description>Direction for port pin</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>IN</name>
                     <description>IN</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUT</name>
                     <description>OUT</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN2</name>
							<description>Direction for port pin</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>IN</name>
                     <description>IN</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUT</name>
                     <description>OUT</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN1</name>
							<description>Direction for port pin</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>IN</name>
                     <description>IN</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUT</name>
                     <description>OUT</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEN0</name>
							<description>Direction for port pin</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>IN</name>
                     <description>IN</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OUT</name>
                     <description>OUT</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP1PUL</name>
					<description>GPIO Port 1 output pull up enable.</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000008</size>
             <resetValue>0x000000FF</resetValue>
					<fields>
						<field>
							<name>PUL7</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL6</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL5</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL4</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL3</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL2</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL1</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUL0</name>
							<description>Pull Up Enable for port pin</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
