ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM363.xml
				<register>
					<name>GP1CLR</name>
					<description>GPIO Port 1 data out clear.</description>
					<addressOffset>0x00000020</addressOffset>
					<size>0x00000008</size>
             <access>write-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CLR7</name>
							<description>Set Output Low for port pin</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLR6</name>
							<description>Set Output Low for port pin</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLR5</name>
							<description>Set Output Low for port pin</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLR4</name>
							<description>Set Output Low for port pin</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLR3</name>
							<description>Set Output Low for port pin</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLR2</name>
							<description>Set Output Low for port pin</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLR1</name>
							<description>Set Output Low for port pin</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLR0</name>
							<description>Set Output Low for port pin</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>CLR</name>
                     <description>CLR</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GP1TGL</name>
					<description>GPIO Port 1 pin toggle.</description>
					<addressOffset>0x00000024</addressOffset>
					<size>0x00000008</size>
             <access>write-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TGL7</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL6</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL5</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL4</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL3</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL2</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL1</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGL0</name>
							<description>Toggle Output for port pin</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>TGL</name>
                     <description>TGL</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
