ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM363.xml
				<register>
					<name>DMAPERID3</name>
             <description>Peripheral identification 3</description>
					<addressOffset>0x00000FEC</addressOffset>
					<size>0x00000008</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MODNUM</name>
							<description>The customer must update this field if they modify the RTL of the controller.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAPCELLID0</name>
             <description>PrimeCell identification 0</description>
					<addressOffset>0x00000FF0</addressOffset>
					<size>0x00000008</size>
             <access>read-only</access>
             <resetValue>0x0000000D</resetValue>
					<fields>
						<field>
							<name>PCELLID0</name>
							<description>Primecell Identification</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAPCELLID1</name>
             <description>PrimeCell identification 1</description>
					<addressOffset>0x00000FF4</addressOffset>
					<size>0x00000008</size>
             <access>read-only</access>
             <resetValue>0x000000F0</resetValue>
					<fields>
						<field>
							<name>PCELLID1</name>
							<description>Primecell Identification</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAPCELLID2</name>
             <description>PrimeCell identification 2</description>
					<addressOffset>0x00000FF8</addressOffset>
					<size>0x00000008</size>
             <access>read-only</access>
             <resetValue>0x00000005</resetValue>
					<fields>
						<field>
							<name>PCELLID2</name>
							<description>Primecell Identification</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAPCELLID3</name>
             <description>PrimeCell identification 3</description>
					<addressOffset>0x00000FFC</addressOffset>
					<size>0x00000008</size>
             <access>read-only</access>
             <resetValue>0x000000B1</resetValue>
					<fields>
						<field>
							<name>PCELLID3</name>
							<description>Primecell Identification</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
     <peripheral>
       <name>NVIC</name>
       <description>Nested Vectored Interrupt Controller</description>
       <groupName>NVIC</groupName>
       <baseAddress>0xE000E000</baseAddress>
       <addressBlock>
         <offset>0</offset>
         <size>0xF04</size>
         <usage>registers</usage>
       </addressBlock>
       <registers>
         <register>
             <name>ICTR</name>
             <description>Shows the number of interrupt lines that the NVIC supports</description>
             <addressOffset>0x00000004</addressOffset>
             <size>0x00000020</size>
             <access>read-only</access>
             <resetValue>0x00000001</resetValue>
             <fields>
               <field>
                 <name>INTLINESNUM</name>
                 <description>Total number of interrupt lines in groups of 32</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>4</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
             <name>STCSR</name>
             <description>SysTick Control and Status Register</description>
             <addressOffset>0x00000010</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>COUNTFLAG</name>
                 <description>Returns 1 if timer counted to 0 since last time this register was read</description>
                 <bitOffset>16</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>CLKSOURCE</name>
                 <description>clock source used for SysTick</description>
                 <bitOffset>2</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>TICKINT</name>
                 <description>If 1, counting down to 0 will cause the SysTick exception to pended.</description>
                 <bitOffset>1</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>ENABLE</name>
                 <description>Enable bit</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
             </fields>
         </register>
         <register>
             <name>STRVR</name>
             <description>SysTick Reload Value Register</description>
             <addressOffset>0x00000014</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>RELOAD</name>
                 <description>Value to load into the Current Value register when the counter reaches 0</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>24</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
             <name>STCVR</name>
             <description>SysTick Current Value Register</description>
             <addressOffset>0x00000018</addressOffset>
             <size>0x00000020</size>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>CURRENT</name>
                 <description>Current counter value</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>32</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
         <register>
             <name>STCR</name>
             <description>SysTick Calibration Value Register</description>
             <addressOffset>0x0000001C</addressOffset>
             <size>0x00000020</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
             <fields>
               <field>
                 <name>NOREF</name>
                 <description>If reads as 1, the Reference clock is not provided</description>
                 <bitOffset>31</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>SKEW</name>
                 <description>If reads as 1, the calibration value for 10ms is inexact</description>
                 <bitOffset>30</bitOffset>
                 <bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
                 <enumeratedValues>
                   <enumeratedValue>
                     <name>DIS</name>
                     <description>DIS</description>
                     <value>0</value>
                   </enumeratedValue>
                   <enumeratedValue>
                     <name>EN</name>
                     <description>EN</description>
                     <value>1</value>
                   </enumeratedValue>
                 </enumeratedValues>
               </field>
               <field>
                 <name>TENMS</name>
                 <description>An optional Reload value to be used for 10ms (100Hz) timing</description>
                 <bitOffset>0</bitOffset>
                 <bitWidth>24</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                      </range>
                 </writeConstraint>
               </field>
             </fields>
         </register>
