ArduPilot/ChibiOS.svn/tools/embsysregviewdata/data/ARM_Cortex-M3/ADI/ADuCM363.xml
    </registers>
    </peripheral>
		<peripheral>
			<name>ADI_ADC0</name>
			<description>Analog to Digital Converter</description>
			<groupName>ADC0</groupName>
			<baseAddress>0x40030000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x4C</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC0</name>
				<value>13</value>
			</interrupt>
			<registers>
				<register>
					<name>ADC0STA</name>
					<description>ADC Status register</description>
					<addressOffset>0x00000000</addressOffset>
					<size>0x00000008</size>
             <access>read-only</access>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CAL</name>
							<description>ADC Calibration status register</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ERR</name>
							<description>ADC conversion error status bit.</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ATHEX</name>
							<description>ADC Accumulator Comparator Threshold status bit.</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>THEX</name>
							<description>ADC comparator threshold.</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVR</name>
							<description>ADC overrange bit.</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDY</name>
							<description>valid conversion result</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0MSKI</name>
					<description>Interrupt control register</description>
					<addressOffset>0x00000004</addressOffset>
					<size>0x00000008</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ATHEX</name>
							<description>ADC Accumulator Comparator Threshold status bit mask</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>THEX</name>
							<description>ADC comparator threshold mask</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVR</name>
							<description>ADC overrange bit mask.</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDY</name>
							<description>valid conversion result mask</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0CON</name>
					<description>Main control register</description>
					<addressOffset>0x00000008</addressOffset>
					<size>0x00000020</size>
             <resetValue>0x0003038C</resetValue>
					<fields>
						<field>
							<name>ADCEN</name>
							<description>Enable Bit</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCCODE</name>
							<description>ADC Output Coding bits</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>INT</name>
                     <description>INT</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UINT</name>
                     <description>UINT</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUFPOWN</name>
							<description>Negative buffer power down</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Disable powerdown - Negative buffer is enabled</description>
                     <value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>Enable powerdown - Negative buffer is disabled</description>
                     <value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUFPOWP</name>
							<description>Positive buffer power down</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Disable powerdown - Positive buffer is enabled</description>
                     <value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>Enable powerdown - Positive buffer is disabled</description>
                     <value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUFBYPP</name>
							<description>Positive buffer bypass</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUFBYPN</name>
							<description>Negative buffer bypass</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
                     <description>DIS</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
                     <description>EN</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCREF</name>
							<description>Reference selection</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>INTREF</name>
                     <description>INTREF</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTREF</name>
                     <description>EXTREF</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTREF2</name>
                     <description>EXTREF2</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AVDDREF</name>
                     <description>AVDDREF</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCDIAG</name>
							<description>Diagnostic Current bits bits</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIAG_OFF</name>
                     <description>DIAG_OFF</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIAG_POS</name>
                     <description>DIAG_POS</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIAG_NEG</name>
                     <description>DIAG_NEG</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIAG_ALL</name>
                     <description>DIAG_ALL</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCCP</name>
							<description>AIN+ bits</description>
							<bitOffset>5</bitOffset>
							<bitWidth>5</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>AIN0</name>
                     <description>AIN0</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN1</name>
                     <description>AIN1</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN2</name>
                     <description>AIN2</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN3</name>
                     <description>AIN3</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN4</name>
                     <description>AIN4</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN5</name>
                     <description>AIN5</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN6</name>
                     <description>AIN6</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN7</name>
                     <description>AIN7</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN8</name>
                     <description>AIN8</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN9</name>
                     <description>AIN9</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN10</name>
                     <description>AIN10</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN11</name>
                     <description>AIN11</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DAC</name>
                     <description>DAC</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AVDD4</name>
                     <description>AVDD4</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IOVDD4</name>
                     <description>IOVDD4</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AGND</name>
                     <description>AGND</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TEMP</name>
                     <description>TEMP</description>
									<value>16</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCCN</name>
							<description>AIN- bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
                 <writeConstraint>
                      <useEnumeratedValues>true</useEnumeratedValues>
                  </writeConstraint>
							<enumeratedValues>
								<enumeratedValue>
									<name>AIN0</name>
                     <description>AIN0</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN1</name>
                     <description>AIN1</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN2</name>
                     <description>AIN2</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN3</name>
                     <description>AIN3</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN4</name>
                     <description>AIN4</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN5</name>
                     <description>AIN5</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN6</name>
                     <description>AIN6</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN7</name>
                     <description>AIN7</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN8</name>
                     <description>AIN8</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN9</name>
                     <description>AIN9</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN10</name>
                     <description>AIN10</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AIN11</name>
                     <description>AIN11</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DAC</name>
                     <description>DAC</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>AGND</name>
                     <description>AGND</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TEMP</name>
                     <description>TEMP</description>
									<value>17</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0OF</name>
             <description>Offset calibration register</description>
					<addressOffset>0x0000000C</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Offset</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0INTGN</name>
             <description>Gain calibration register when using internal reference</description>
					<addressOffset>0x00000010</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00005555</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Gain with Int Ref</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0EXTGN</name>
             <description>Gain calibration register when using external reference</description>
					<addressOffset>0x00000014</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00005555</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Gain with Ext Ref</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC0VDDGN</name>
             <description>Gain calibration register when using AVDD as the ADC reference</description>
					<addressOffset>0x00000018</addressOffset>
					<size>0x00000010</size>
             <resetValue>0x00005555</resetValue>
					<fields>
						<field>
							<name>VALUE</name>
							<description>Gain with Avdd Ref</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
                 <writeConstraint>
                      <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                      </range>
                 </writeConstraint>
						</field>
					</fields>
				</register>
